# 1. **Introduction to Python**

**Python** is a simple and powerful programming language created by **Guido van Rossum** in **1991**. It’s great for beginners and used by companies like **Google and Netflix**.

**Python** is:
* Easy to learn
* Easy to read
* Used for websites, games, data, and AI

**Why Learn Python?**
* It is great for beginners, useful in real-world projects, builds logic and problem-solving skills.

**Example:**

In [4]:
print("Hello World")

Hello World

# 2. **Data Types**

In Python, **data types** tell the computer what kind of data you are working with. Below are the most common types:

* Variables
* Numbers
* Strings
* Lists
* Tuples
* Dictionaries
* Sets 

Starting from 

# **Variables**: 
 A variable is where you can store a information.
You give it a name, and it holds a value.

In [15]:
# Storing information in variables
name = "Ali"
age = 13

# Using the variables
print("My name is", name)
print("I am", age, "years old")

My name is Ali
I am 13 years old

# **Numbers**:
In Python, numbers are used to perform math operations like addition, subtraction, multiplication, and division.

Python mainly uses two types of numbers:

- **Integer (`int`)** → Whole numbers (like `10`, `100`, `-5`)
- **Float (`float`)** → Decimal numbers (like `3.14`, `5.99`, `-0.1`)

In [18]:
9 #integer

9

In [19]:
6.3+5.7 #float

12.0

# **Strings**:
In Python, a **string** is a piece of text written inside **quotes**.

Strings can have letters, numbers, or symbols.  
You can use **single quotes (' ')** or **double quotes (" ")** — both work the same.

Examples:
- "Hello"
- 'Python'
- "123 Main Street"

In [20]:
print("Hello")

Hello

In [21]:
print("Python")

Python

In [22]:
print("123 Main Street")

123 Main Street

* **Access values in strings**:
In Python, you can **access individual characters** in a string using **index numbers**.

- Indexing starts from **0**
- Use square brackets "[ ]" to access characters
- "[ : ]" is used to get a range of characters from string.

In [23]:
# Example of accessing characters in a string

message = "Welcome"

# Get first character
print("message[0]:", message[0])

# Get characters from index 1 to 4 (W is 0, e is 1, l is 2, c is 3, o is 4)
print("message[1:5]:", message[1:5])

message[0]: W
message[1:5]: elco

* **Updating a String in Python**:
Strings in Python are **immutable**, which means you cannot change characters directly.
But you can create a **new string** by combining parts of the old string using **slicing** and **concatenation (+)**.

Example: Replacing a part of the string with something else.

In [25]:
# Original string
stringVariable = "Hello World"

# Replace "World" with "Python"
stringVariable = stringVariable[:6] + "Python"

# Print updated string
print("Updated string:", stringVariable)

Updated string: Hello Python

* **Deleting a String in Python**:
To delete a string (or any variable) in Python, use the **del** keyword.This removes the variable from memory.  
After deletion, you can no longer use it — it will give an error if you try.
**[Error: name 'message' is not defined]**

In [ ]:
# Create a string
message = "Hello World"

# Delete the string
del message

# Try to print it (will cause an error)
print(message)

* **String Formatting Operator in Python**:

The **string formatting operator** in Python is the **percent sign " % "**.It is used to insert values into a string, like we do in filling the blanks.

Common Format Types:
* **%s** → string
* **%d** → integer (whole number)
* **%f** → float (decimal number)

In [28]:
 print ("My name is %s and weight is %d kg!" % ("Zara",50))

My name is Zara and weight is 50 kg!

# **List**:

A **list** is a collection of items stored in a single variable.

- Lists are written inside **square brackets "[ ]"**
- Items can be **numbers, strings, or both**
- Lists can store **multiple values**
- 
**Examples of Lists**:
- A list of numbers: [1, 2, 3, 4]
- A list of names: ["Ali", "Sara", "Ayaan"]
- A mixed list: [10, "apple", 3.5, "Mbappe"]

In [30]:
#make a list name data
data= ['Mehvish','1880']
print(data)

['Mehvish', '1880']

* **Accessing Values in Lists**:

You can access items in a list using **index numbers**.
- Use square brackets `[ ]` to get an item by its index

In [31]:
list1 = ['physics', 'chemistry', 1997, 2000];
list2 = [1, 2, 3, 4, 5, 6, 7 ];
print ("list1[0]: ", list1[0])
print ("list2[1:5]: ", list2[1:5])

list1[0]:  physics
list2[1:5]:  [2, 3, 4, 5]

* **Updating Lists**:
We can update single or mupltiple elements of a list by giving *slice* on left hand of the assignment operator.

In [33]:
list1 = ['physics', 'chemistry', 1997, 2000]
list1[1] = "computer science"
print(list1)

['physics', 'computer science', 1997, 2000]

* **Deleting List Elements in Python**:

You can delete an item from a list using:
* "del" → Removes an item by index

In [35]:
list1 = ['physics', 'chemistry', 1997, 2000];
print (list1)
del list1[2];
print ("After deleting value at index 2 : ")
print (list1)

['physics', 'chemistry', 1997, 2000]
After deleting value at index 2 :
['physics', 'chemistry', 2000]

# **Dictionary**:

A **dictionary** in Python is used to store **data in key-value pairs**.

- Each item has a **key** and a **value**
- Keys are **unique**
- Written using **curly braces** "{}"
- Access values using the key name

---

* **Example**:
student = {
    "name": "Ali",
    "age": 13,
    "grade": "8th" }

* "name", "age", and "grade" are the keys
* "Ali", 13, and "8th" are the values

In [37]:
dict = {'Name':"Mehvish", 'Depart': "BCS", 'Batch': 2014}
print (dict['Depart'])

BCS

* **Updating a Dictionary in Python**:

To update a dictionary:

- You can **change the value** of an existing key
- You can **add a new key-value pair** if the key doesn't exist
- Use this syntax: `dictionary[key] = new_value`

In [39]:
dict = {'Name':"Mehvish", 'Depart': "BCS", 'Batch': 2014}
print (dict)
dict['Batch'] = "SP14"
print (dict)
dict['University'] = "NUST"
print(dict)

{'Name': 'Mehvish', 'Depart': 'BCS', 'Batch': 2014}
{'Name': 'Mehvish', 'Depart': 'BCS', 'Batch': 'SP14'}
{'Name': 'Mehvish', 'Depart': 'BCS', 'Batch': 'SP14', 'University': 'NUST'}

* **Deleting Dictionary Elements**:

You can delete items from a dictionary using:
* **del dictionary[key]**  deletes the key and its value

In [47]:
player = {
    "name": "Messi",
    "age": 38,
    "team": "Inter Miami",
}

del player ["age"]

print("After deleting items:", player)

After deleting items: {'name': 'Messi', 'team': 'Inter Miami'}

# **Tuple**:

A **tuple** is like a list, but it **cannot be changed** (it is **immutable**).

- Tuples are written with **round brackets ()**
- You can store **multiple items**
- You can **access** items, but **cannot modify** or **delete** them

In [48]:
tup = ('Math','98', 'C programming', '99')
print (tup)
print(tup[1])
print(tup[1:3])

('Math', '98', 'C programming', '99')
98
('98', 'C programming')

* **Updating a Tuple in Python**:

Tuples are **immutable**, meaning you cannot change their items directly.

This is invalid and causes an error:

tup1[0] = 100  #Not allowed

In [51]:
# Original tuples
tup1 = (12, 34.56)
tup2 = ("abc", "xyz")

# Combine tuples to create a new one
tup3 = tup1 + tup2

# Print the new tuple
print("Updated tuple:", tup3)

Updated tuple: (12, 34.56, 'abc', 'xyz')

* **Delete tuple elements**:
* Removing an element from Tuple is not possible because they can't be updated.
* **del** statment is used to remove entire Tuple
* Error will appear named **NameError: name 'tup' is not defined**

In [ ]:
tup = ('physics', 'chemistry', 1997, 2000);
print (tup);
del tup;
print ("After deleting tup : ");
print (tup);

* **Sets**:

A **set** is an unordered collection of unique items.

- Sets are written using **curly braces "{}"**
- The order is **not guaranteed**
- You can add or remove items, but you can't access by index

In [55]:
# Convert list to set and check types
list1 = [1, 2, 3, 4, 5]
print(type(list1))

my_set = set(list1)
print(my_set)
print(type(my_set))

# Create a set of integers
my_set = {1, 2, 3}
print(my_set)

# Create a set with mixed data types
my_set = {1, "Hello", 1.2, 'C'}

# Add a single value to the set
my_set.add('D')

# Add multiple values from a list
my_set.update(list1)

# Print the updated set
print(my_set)

# Safely discard an element (no error even if it doesn't exist)
my_set.discard('G')

# Remove an element (will raise an error if not found)
# Uncommenting the next line will raise a KeyError
# my_set.remove('G')

<class 'list'>
{1, 2, 3, 4, 5}
<class 'set'>
{1, 2, 3}
{1, 1.2, 2, 3, 4, 5, 'D', 'Hello', 'C'}

* **Cause of error**:
In Python, each statement (like print(...)) must be complete on its own line or properly separated.
in this example there were two print() statements without separating them, which is not allowed.

* Option 1 — Use **two separate lines**.
* Option 2 — Use a **semicolon ;** to separate them.

# 3. **Operators**:

* Operators in python are used to **compare two values**.

They return a **Boolean result**:  
- "True" if the condition is correct  
- "False" if it's not

In [1]:
15 <= 23

True

In [2]:
3 != 4

True

# **4. If-Else Statements**:

**if-else** statement is used to **make decisions** in your program.

- "if" checks a condition
- If the condition is **True**, the code inside "if" runs
- If it's **False**, the code inside "else" runs

In [8]:
if 7 % 2:
    print("Even number")
else:
    print("Odd number")

Even number

# **5. For and While Loop**:

It is used when we want to repeat a task. Python has **For** and **While** loop for repeatition of a task.

In [4]:
# for loop example.
fruits = ["apple", "banana", "mango"]

for fruit in fruits:
    print("I like", fruit)

I like apple
I like banana
I like mango

In [16]:
# while loop example
a = 2
while a < 10:
    a = a + 1
    print(a)

3
4
5
6
7
8
9
10

* An **Indentation** Error occured which means python needs proper spacing.

# **Functions**

A **function** is a block of reusable code that runs only when you **call** it.

- You define a function using the `def` keyword
- You can pass **data (parameters)** into it
- You can **return** a value (optional)

In [24]:
# Function that greets the user
def greet(name):
    print("Hello,", name)

# Calling the function with different names
greet("Ayaan")
greet("Mehvish")

Hello, Ayaan
Hello, Mehvish

# **7. Lambda Functions**:

A **lambda function** is a short, one-line function with no name.

In [31]:
#Normal function
def  f (x):
  return  x**2
print (f(2))

4

In [39]:
#Lambda Function
#lambda expressions (lambda var)
times4 = lambda var:var*4
times4(25)
#lambda expressions: another way to write a function in line

100

# **Map**:

The "map()" function applies a **function to each item** in a list (breaks the sentence into a list of words) and returns a new map object (calculating lenghts of words).

In [47]:
sentence = 'It is raining cats and dogs'
words = sentence.split()
print (words)
lengths = map(lambda word: len(word), words)
list(lengths)

['It', 'is', 'raining', 'cats', 'and', 'dogs']

[2, 2, 7, 4, 3, 4]

# **Filter**:

The `filter()` function is used to **select items** from a list (or iterable) **that meet a condition**.

In [49]:
fib = [0,1,1,2,3,5,8,13,21,34,55]
result1 = filter(lambda x: x % 2, fib)
list(result1)

[1, 1, 3, 5, 13, 21, 55]

# **8. File I/O**:

* Basic **I/O** function (methods):

# **Reading input from Keyboard**:

Python uses the **input()** function to get data from the user through the keyboard.

In [61]:
#from six.moves import input
string = input("Enter your name: ");
print(string)

Enter your name:  cristiano ronaldo

cristiano ronaldo

# **I/O from or to Text File**:

Python allows you to **read from** and **write to** text files using built-in functions like `open()`, `read()`, `write()`, and `close()`.

* **modes: "r" (read), "w" (write), "a" (append), "r+" (read/write)**

In [71]:
# Open a file to read
fileOpen = open("file.txt", "r+")
str = fileOpen.read(); #to read specific content from start you can use read(12). It will read 12 characters
#from the start of file
print (str)
# Close opend file
fileOpen.close()
# Open a file to append
fileOpen = open("file.txt", "a+")
fileOpen.write("Information Technology Lahore");
fileOpen.close()
# Open a file to read
fileOpen = open("file.txt", "r+")
string = fileOpen.read(); #to read specific content from start you can use read(12). It will read 12 characte
#rs from the start of file
print (string)
# Close opend file
fileOpen.close()

 Information Technology Lahore Information Technology LahoreAl Nasser FC
 Information Technology Lahore Information Technology LahoreAl Nasser FCInformation Technology Lahore

# **File Position**:

* `tell()` method tells the currenct position within the file.
* `seek()` method changes the current file location

In [72]:
# Open a file
fo = open("file.txt", "r+")
str = fo.read(10);
print("ReadStringis:\n",str)
# Check current position
position = fo.tell();
print("Currentfileposition:\n", position)
#Repositionpointeratthebeginning once again
position = fo.seek(0, 0);
str = fo.read(10);
print("AgainreadStringis:\n", str)
# Close opend file
fo.close()

ReadStringis:
  Informati
Currentfileposition:
 10
AgainreadStringis:
  Informati

In [73]:
import os
# renameafile
os.rename("file.txt","newfile.txt")

In [74]:
#remove file
os.remove("newfile.txt")

# **9. Pandas Introduction**:

* **Introduction to Pandas in Python**

**Pandas** is a Python library used for **data analysis** and **data manipulation**.

It helps you:
- Handle large amounts of data easily
- Read and write data from files (CSV, Excel, etc.)
  
To start using it:

* **import pandas as pd**

# **10. Series**:

A **Series** is a one-dimensional data structure in pandas, similar to a **list** or a **column in Excel**.

It holds:
- **Data** (like numbers or text)
- An **index** (like row numbers)
- Think of a Series like a single column of data.

# **From ndarray**:
### Creating a Pandas Series from ndarray:

In [7]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
"""following a fucntion is called from panas to create a series.
data would be 5 random values and indexes are assigned a-e"""
s = pd.Series(np.random.randn(5), index=['a', 'b', 'c', 'd', 'e'])
# Print the Series so output appears
print(s)

a   -0.977278
b    0.950088
c   -0.151357
d   -0.103219
e    0.410599
dtype: float64

**It wasnt giving an output untill ( print(s) ).**

In [8]:
"""Following function will print the index and its datatype"""
s.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [9]:
"""If we don't assign the index then it will of length having values [0....len(data-1)]"""
pd.Series(np.random.randn(5))

0    0.144044
1    1.454274
2    0.761038
3    0.121675
4    0.443863
dtype: float64

# **From dict**:

### Creating a Pandas Series from a Dictionary:

In pandas, you can create a Series using a Python dictionary.  
- The **keys** of the dictionary become the **index**
- The **values** become the **data**

In [10]:
""" In following example, indexes are not given to it is constructed from the sorted keys of the dict"""
d = {'a' : 0., 'b' : 1., 'c' : 2.} # a python dict
pd.Series(d)

a    0.0
b    1.0
c    2.0
dtype: float64

In [11]:
""" In following example, index are given, so the values in data corresponding in the index will be pulled ou
t"""
pd.Series(d, index=['b', 'c', 'd', 'a'])

b    1.0
c    2.0
d    NaN
a    0.0
dtype: float64

# **From a scalar value**:

* If data is a scalar value, an index must be provided. The value will be repeated to match the length of index

In [12]:
"""In following example, a scalar value is given as data so it will be repeated to match the length of inde
x"""
pd.Series(5., index=['a', 'b', 'c', 'd', 'e'])

a    5.0
b    5.0
c    5.0
d    5.0
e    5.0
dtype: float64

# **Series is ndarray-like**:

* **Pandas Series is ndarray-like**:

A **Series** in pandas is very similar to a **NumPy ndarray (1-dimensional array)**.

Why?
- It holds **a single column of data**
- It supports **indexing, slicing, arithmetic operations**, and more
- It is built on top of **NumPy**, so it behaves like a NumPy array

But unlike an ndarray, a Series has **labels (indexes)** for each element.

In [15]:
#we can access a value just like ndarray
#access single value
s[0]

C:\Users\haier\AppData\Local\Temp\ipykernel_9184\2232011024.py:3: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  s[0]

np.float64(-0.977277879876411)

In [14]:
#access range of values
s[:5]

a   -0.977278
b    0.950088
c   -0.151357
d   -0.103219
e    0.410599
dtype: float64

In [16]:
""" Following example will return a range of values in series whose value is greater than the median of serie
s"""
s[s > s.median()]

b    0.950088
e    0.410599
dtype: float64

In [17]:
"""Following example is return the values in series with indexes. 4,3,1 are the positions of the indexs
For example: the index at 4,3,1 are e,d,b respectively"""
s[[4, 3, 1]]

C:\Users\haier\AppData\Local\Temp\ipykernel_9184\1684425401.py:3: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  s[[4, 3, 1]]

e    0.410599
d   -0.103219
b    0.950088
dtype: float64

In [18]:
""" Following example returns the exponent values. just like e^a (here a is index and its respective data is
placed here)"""
np.exp(s)

a    0.376334
b    2.585938
c    0.859541
d    0.901930
e    1.507720
dtype: float64

In [19]:
"""Following example will get the data of given index"""
s['a']

np.float64(-0.977277879876411)

In [20]:
"""Following example will update the data of the given index"""
s['e'] = 12.
s # before updating e = 1.399281 but after updating e = 12.000000

a    -0.977278
b     0.950088
c    -0.151357
d    -0.103219
e    12.000000
dtype: float64

In [21]:
""" Following will return true if 'e' is in the values of index otherwise false"""
'e' in s

True

In [ ]:
#"""If a label is not contained and you are trying to access its data, an exception is raised: """
s['f']
# This will create error

**If a label does not exist in a Series and we try to access it directly (like s['f']), it will raise a KeyError.
To avoid this, we use the get() method, which returns None or a default message.**

In [25]:
import pandas as pd

# Create a Series
s = pd.Series([10, 20, 30], index=['a', 'b', 'c'])

# Safe way to access a label that might not exist
print(s.get('f', "Label 'f' not found"))

Label 'f' not found

In [23]:
"""Using the get method, a missing label will return None or specified default"""
s.get('f') #it will return none
s.get('f', np.nan) #it will return default value

nan

# **Vectorized operations and label alignment with Series**:

### Vectorized Operations with Series

Pandas Series supports **vectorized operations**, which means you can perform operations (like +, -, *, /) on the whole Series **without using loops**.

These operations are fast and work element-wise (just like NumPy arrays).


### Label Alignment

When you perform operations between two Series with different indexes, pandas **aligns the labels (indexes)** first.

If a label is missing in one Series, the result will show `NaN` (Not a Number).

In [26]:
"""following will add the data of respective values of indexes. For example, in given output, it is calculate
d as: a = s['a'] +
s['a'] b = s['b'] +
s['b'] c = s['c'] +
s['c'] d = s['d'] +
s['d'] e = s['e'] +
s['e']
"""
s + s

a    20
b    40
c    60
dtype: int64

In [27]:
"""following will multiply the data of each values of indexes, with 2. For example, in given output, it is ca
lculated as:
a = s['a'] *2
b = s['b'] *2
c = s['c'] *2
d = s['d'] *2
e = s['e'] *2"""
s * 2

a    20
b    40
c    60
dtype: int64

In [28]:
s = pd.Series(np.random.randn(5), name='something')
s

0    0.333674
1    1.494079
2   -0.205158
3    0.313068
4   -0.854096
Name: something, dtype: float64

In [29]:
s.name #print the name attribute of series

'something'

In [30]:
#rename the series name attribute and assign to s2 object. Note that s and s2 refer to different objects.
s2 = s.rename("different")
s2.name

'different'

# **11. Data Frames**:

A **DataFrame** is a 2-dimensional table (rows and columns), like a **spreadsheet** or **Excel sheet**, used to store and analyze data.
Each column can have a different data type (numbers, strings, etc.).

**Features of DataFrame**:
- Rows and columns, each with labels (index and column names)
- Can be created from lists, dictionaries, arrays, or external files (like CSV)
- Easy to view, filter, and analyze data

# **From dict of Series or dicts**:

Creating a DataFrame from a Dictionary of Series or Dictionaries

In Pandas, you can create a **DataFrame** from:
- A dictionary where **values are Series**  
- A dictionary where **values are dictionaries**

Each **key** becomes a **column name**.

If Series or inner dictionaries have **labels (indexes)**, Pandas aligns them by row index.

In [4]:
import pandas as pd

# A dictionary of Series is created
d = {
    'one': pd.Series([1., 2., 3.], index=['a', 'b', 'c']),
    'two': pd.Series([1., 2., 3., 4.], index=['a', 'b', 'c', 'd'])
}

# Create a DataFrame from the dictionary
df = pd.DataFrame(d)

# Display the DataFrame
print(df)

   one  two
a  1.0  1.0
b  2.0  2.0
c  3.0  3.0
d  NaN  4.0

* **Error occured cause of **Triple quotes** used **Comment not closed**

In [5]:
""" a data frame will be constructed for given row labels"""
pd.DataFrame(d, index=['d', 'b', 'a'])

   one  two
d  NaN  4.0
b  2.0  2.0
a  1.0  1.0

In [6]:
"""following example shows a data frame when we give coloumn labels"""
pd.DataFrame(d, index=['d', 'b', 'a'], columns=['two', 'three'])

   two three
d  4.0   NaN
b  2.0   NaN
a  1.0   NaN

In [7]:
df.columns

Index(['one', 'two'], dtype='object')

# **From dict of ndarrays / lists**:

You can create a DataFrame using a dictionary where:
- **Keys** become **column names**
- **Lists or NumPy arrays** become the **column values**

All columns must be the **same length**.

In [13]:
import pandas as pd

# The following example shows that all ndarrays (lists) must have the same length
d = {
    'one': [1., 2., 3., 4.],
    'two': [4., 3., 2., 1.]
}

# Since we're using a dict with keys, those keys become the column labels
df = pd.DataFrame(d)

# Display the DataFrame
print(df)

   one  two
0  1.0  4.0
1  2.0  3.0
2  3.0  2.0
3  4.0  1.0

* Error occured cause triple comments were used """ for comments	Python treats it as a string, not a comment

In [14]:
"""If indexs are given then it would be same length as arrays"""
pd.DataFrame(d, index=['a', 'b', 'c', 'd'])

   one  two
a  1.0  4.0
b  2.0  3.0
c  3.0  2.0
d  4.0  1.0

# **From a list of dicts**:

In [15]:
"""constructing data frame from a list of dicts"""
data2 = [{'a': 1, 'b': 2}, {'a': 5, 'b': 10, 'c': 20}]
pd.DataFrame(data2)

   a   b     c
0  1   2   NaN
1  5  10  20.0

In [16]:
"""passing list of dicts as data and indexes (row labels)"""
pd.DataFrame(data2, index=['first', 'second'])

        a   b     c
first   1   2   NaN
second  5  10  20.0

In [17]:
"""passing list of dicts as data and columns (columns labels)"""
pd.DataFrame(data2, columns=['a', 'b'])

   a   b
0  1   2
1  5  10

# **From a dict of tuples**:

In [19]:
pd.DataFrame({('a', 'b'): {('A', 'B'): 1, ('A', 'C'): 2},
('a', 'a'): {('A', 'C'): 3, ('A', 'B'): 4},
('a', 'c'): {('A', 'B'): 5, ('A', 'C'): 6},
('b', 'a'): {('A', 'C'): 7, ('A', 'B'): 8},
('b', 'b'): {('A', 'D'): 9, ('A', 'B'): 10}})   #"NaN shows missing data

       a              b
       b    a    c    a     b
A B  1.0  4.0  5.0  8.0  10.0
  C  2.0  3.0  6.0  7.0   NaN
  D  NaN  NaN  NaN  NaN   9.0

# **Alternate Constructors**:

Alternate Constructors in Pandas provides **alternate constructors** to create DataFrames or Series from different types of data.
You don’t always need to use a dictionary or list — Pandas supports:

In [23]:
import numpy as np
data = np.zeros((2,), dtype=[('A', 'i4'),('B', 'f4'),('C', 'a10')])
data

C:\Users\haier\AppData\Local\Temp\ipykernel_1020\1946278750.py:2: DeprecationWarning: Data type alias 'a' was deprecated in NumPy 2.0. Use the 'S' alias instead.
  data = np.zeros((2,), dtype=[('A', 'i4'),('B', 'f4'),('C', 'a10')])

array([(0, 0., b''), (0, 0., b'')],
      dtype=[('A', '<i4'), ('B', '<f4'), ('C', 'S10')])

* import numpy as np is added before example otherwise it was giving error

In [24]:
pd.DataFrame.from_records(data, index='C')

     A    B
C
b''  0  0.0
b''  0  0.0

**DataFrame.from_items**:

In [26]:
import pandas as pd

# Use dictionary instead of from_items
df = pd.DataFrame({
    'A': [1, 2, 3],
    'B': [4, 5, 6]
})

print(df)

   A  B
0  1  4
1  2  5
2  3  6

In [29]:
import pandas as pd

# Using dictionary instead of from_items
data = {
    'A': [1, 2, 3],
    'B': [4, 5, 6]
}

# Convert to DataFrame with 'A' and 'B' as row indexes
df = pd.DataFrame.from_dict(data, orient='index', columns=['one', 'two', 'three'])

print(df)

   one  two  three
A    1    2      3
B    4    5      6

* Error was occuring cause of This code was valid only in very old versions of Pandas (pre-1.0).

**Column selection, addition, deletion**:

In [32]:
df['one'] # it is displaying data under coloumn 'one'

A    1
B    4
Name: one, dtype: int64

In [33]:
df['three'] = df['one'] * df['two'] # assigning values to a colomn named 'three' after calculation
df['flag'] = df['one'] > 2 #check if value at column 'one' is > 2 then assign True otherwise false
df #print a complete data frame

   one  two  three   flag
A    1    2      2  False
B    4    5     20   True

In [34]:
del df['two'] #delete a coloumn 'two' from data frame
three = df.pop('three') #pop a complete coloumn 'three' from dataframe
df

   one   flag
A    1  False
B    4   True

In [35]:
df['foo'] = 'bar' #a coloumn 'foo' will be populated with 'bar'
df

   one   flag  foo
A    1  False  bar
B    4   True  bar

In [37]:
"""following example will take values from coloumn one until give range and will populate the new coloumn"""
df['one_trunc'] = df['one'][:2]
df

   one   flag  foo  one_trunc
A    1  False  bar          1
B    4   True  bar          4

In [38]:
"""following function has three arguments.
First argument: index where new coloumn will be inserted.
Second argument: label or title of a new coloumn
Third argument: it will create a coloumn at specified position"""
df.insert(1, 'bar2', df['one'])
df

   one  bar2   flag  foo  one_trunc
A    1     1  False  bar          1
B    4     4   True  bar          4

**Indexing / Selection**:

* Indexing and Selection in Pandas n allow you to access specific **rows**, **columns**, or **values** in a DataFrame or Series.

In [44]:
df.loc['b'] #it will return the coloumn labels and values on row label 'b'

one             2
2           False
bar             2
bar2         flag
foo     one_trunc
Name: b, dtype: object

In [52]:
import pandas as pd

# Create the DataFrame
data = {
    'one': [1, 2, 3],
    3: [True, False, True],          # Yes, 3 is used as a column name (valid in pandas)
    'bar': [2, 2, None],
    'bar2': ['baz', 'flag', 'flag'],
    'foo': ['bar_trunc', 'one_trunc', 'one_trunc']
}

# Custom index
df = pd.DataFrame(data, index=['a', 'b', 'c'])

# Display the third row (index = 2 => label 'c')
print(df.iloc[2])

one             3
3            True
bar           NaN
bar2         flag
foo     one_trunc
Name: c, dtype: object

**Data alignment and arithmetic**:

In [53]:
df = pd.DataFrame(np.random.randn(10, 4), columns=['A', 'B', 'C', 'D'])
df2 = pd.DataFrame(np.random.randn(7, 3), columns=['A', 'B', 'C'])
df + df2 # add values of respective coloumn labels

          A         B         C   D
0 -0.149830  2.247494  1.871203 NaN
1  2.570845 -0.180146  0.168791 NaN
2  1.524467 -2.461665 -3.091136 NaN
3 -1.245856  1.222271  2.801686 NaN
4  2.239671  0.721712 -0.071142 NaN
5 -2.398327  0.308857 -1.286085 NaN
6 -0.238017 -0.195010 -0.739020 NaN
7       NaN       NaN       NaN NaN
8       NaN       NaN       NaN NaN
9       NaN       NaN       NaN NaN

In [54]:
df - df.iloc[0]

          A         B         C         D
0  0.000000  0.000000  0.000000  0.000000
1  1.957023 -0.067862 -1.570845  1.343724
2  0.998770 -2.621957 -3.279808  2.530497
3 -0.241476  0.343968 -0.277644  2.898511
4  2.541690  0.736202 -1.121296  0.027900
5 -0.733809  0.157652 -3.020289  1.413422
6  0.252933 -1.432326 -2.975831 -0.108650
7 -0.161960 -0.380069 -3.264302  0.784461
8  1.765546  0.331248 -2.497711  0.913978
9  0.473637 -0.493651 -3.117136  2.986018

In [55]:
df*5+2

           A         B          C          D
0  -2.509125  5.290667  13.464622  -3.850605
1   7.275992  4.951357   5.610397   2.868015
2   2.484725 -7.819117  -2.934419   8.801882
3  -3.716504  7.010508  12.076401  10.641953
4  10.199324  8.971679   7.858142  -3.711106
5  -6.178172  6.078927  -1.636824   3.216505
6  -1.244462 -1.870960  -1.414531  -4.393853
7  -3.318928  3.390324  -2.856890   0.071699
8   6.318602  6.946908   0.976067   0.719286
9  -0.140940  2.822410  -2.121056  11.079484

In [56]:
1 / df

           A         B         C         D
0  -1.108862  1.519449  0.436124 -0.854612
1   0.947689  1.694136  1.384889  5.760267
2  10.315124 -0.509211 -1.013291  0.735091
3  -0.874660  0.997903  0.496209  0.578573
4   0.609806  0.717187  0.853513 -0.875487
5  -0.611384  1.225813 -1.374826  4.110137
6  -1.541088 -1.291669 -1.464330 -0.782001
7  -0.940039  3.596284 -1.029465 -2.592956
8   1.157782  1.010732 -4.883131 -3.904073
9  -2.335422  6.079691 -1.213281  0.550692

In [57]:
df **4

          A          B          C          D
0  0.661438   0.187610  27.641335   1.874662
1  1.239756   0.121397   0.271856   0.000908
2  0.000088  14.873381   0.948558   3.424809
3  1.708606   1.008433  16.494600   8.924163
4  7.231564   3.779807   1.884342   1.702162
5  7.157231   0.442898   0.279904   0.003504
6  0.177293   0.359248   0.217493   2.674056
7  1.280609   0.005978   0.890334   0.022122
8  0.556535   0.958198   0.001759   0.004305
9  0.033615   0.000732   0.461481  10.873384

Boolean operators work as well:

In [58]:
df1 = pd.DataFrame({'a' : [1, 0, 1], 'b' : [0, 1, 1] }, dtype=bool)
df2 = pd.DataFrame({'a' : [0, 1, 1], 'b' : [1, 1, 0] }, dtype=bool)
pd.DataFrame({'a' : [0, 1, 1], 'b' : [1, 1, 0] }, dtype=bool)

       a      b
0  False   True
1   True   True
2   True  False

In [59]:
df1 & df2 #and logical operator

       a      b
0  False  False
1  False   True
2   True  False

In [60]:
df1 | df2 # or operator

      a     b
0  True  True
1  True  True
2  True  True

In [61]:
-df1

       a      b
0  False   True
1   True  False
2  False  False

**Transposing**:
* To transpose, access the T attribute (also the transpose function), similar to an ndarray

In [63]:
# only show the first 5 rows
df[:5].T

          0         1         2         3         4
A -0.901825  1.055198  0.096945 -1.143301  1.639865
B  0.658133  0.590271 -1.963823  1.002102  1.394336
C  2.292924  0.722079 -0.986884  2.015280  1.171628
D -1.170121  0.173603  1.360376  1.728391 -1.142221

Creating a DataFrame by passing a numpy array, with a datetime index and labeled columns:

In [65]:
dates = pd.date_range('20130101', periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [67]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))
df

                   A         B         C         D
2013-01-01 -0.488203 -0.848622 -0.668648 -0.475333
2013-01-02 -0.726290 -0.115516  1.716154 -0.503761
2013-01-03  1.786169 -1.615903  0.846360  1.299178
2013-01-04 -0.677843 -0.398273 -0.535052  0.759092
2013-01-05  0.121276 -0.345433 -0.458100  0.734903
2013-01-06 -1.268046  0.155471  0.094142 -1.465262

Creating a DataFrame by passing a dict of objects that can be converted to series-like.

In [70]:
df2 = pd.DataFrame({ 'A' : 1.,
'B' : pd.Timestamp('20130102'),
'C' : pd.Series(1,index=list(range(4)),dtype='float32'),
'D' : np.array([3] * 4,dtype='int32'),
'E' : pd.Categorical(["test","train","test","train"]),
'F' : 'foo' })
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [72]:
#Having specific dtypes 
df2.dtypes

A          float64
B    datetime64[s]
C          float32
D            int32
E         category
F           object
dtype: object

# **12. Viewing Data**:

In [73]:
df.head() #display first 5 records

                   A         B         C         D
2013-01-01 -0.488203 -0.848622 -0.668648 -0.475333
2013-01-02 -0.726290 -0.115516  1.716154 -0.503761
2013-01-03  1.786169 -1.615903  0.846360  1.299178
2013-01-04 -0.677843 -0.398273 -0.535052  0.759092
2013-01-05  0.121276 -0.345433 -0.458100  0.734903

In [74]:
df.tail(3) #display last 3 records

                   A         B         C         D
2013-01-04 -0.677843 -0.398273 -0.535052  0.759092
2013-01-05  0.121276 -0.345433 -0.458100  0.734903
2013-01-06 -1.268046  0.155471  0.094142 -1.465262

In [75]:
df.index #display indexes

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [76]:
df.columns #display coloumns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [77]:
df.values # print values

array([[-0.48820281, -0.84862182, -0.66864838, -0.47533273],
       [-0.72629045, -0.11551579,  1.71615396, -0.50376076],
       [ 1.78616877, -1.61590286,  0.84636043,  1.29917821],
       [-0.6778432 , -0.39827341, -0.53505172,  0.75909234],
       [ 0.12127612, -0.3454327 , -0.45810036,  0.73490333],
       [-1.26804558,  0.15547055,  0.09414161, -1.46526189]])

In [78]:
# Transposing your data
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A   -0.488203   -0.726290    1.786169   -0.677843    0.121276   -1.268046
B   -0.848622   -0.115516   -1.615903   -0.398273   -0.345433    0.155471
C   -0.668648    1.716154    0.846360   -0.535052   -0.458100    0.094142
D   -0.475333   -0.503761    1.299178    0.759092    0.734903   -1.465262

In [79]:
#Sorting by an axis
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01 -0.475333 -0.668648 -0.848622 -0.488203
2013-01-02 -0.503761  1.716154 -0.115516 -0.726290
2013-01-03  1.299178  0.846360 -1.615903  1.786169
2013-01-04  0.759092 -0.535052 -0.398273 -0.677843
2013-01-05  0.734903 -0.458100 -0.345433  0.121276
2013-01-06 -1.465262  0.094142  0.155471 -1.268046

In [80]:
#Sorting by values
df.sort_values(by='B')

                   A         B         C         D
2013-01-03  1.786169 -1.615903  0.846360  1.299178
2013-01-01 -0.488203 -0.848622 -0.668648 -0.475333
2013-01-04 -0.677843 -0.398273 -0.535052  0.759092
2013-01-05  0.121276 -0.345433 -0.458100  0.734903
2013-01-02 -0.726290 -0.115516  1.716154 -0.503761
2013-01-06 -1.268046  0.155471  0.094142 -1.465262

In [81]:
# Describe shows a quick statistic summary of your data
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.208823 -0.528046  0.165809  0.058136
std    1.074869  0.628294  0.943254  1.040250
min   -1.268046 -1.615903 -0.668648 -1.465262
25%   -0.714179 -0.736035 -0.515814 -0.496654
50%   -0.583023 -0.371853 -0.181979  0.129785
75%   -0.031094 -0.172995  0.658306  0.753045
max    1.786169  0.155471  1.716154  1.299178

In [82]:
#Selecting a single column, which yields a Series, equivalent to df.A
df['A']

2013-01-01   -0.488203
2013-01-02   -0.726290
2013-01-03    1.786169
2013-01-04   -0.677843
2013-01-05    0.121276
2013-01-06   -1.268046
Freq: D, Name: A, dtype: float64

In [83]:
 #Selecting via [], which slices the rows.
df[0:3]

                   A         B         C         D
2013-01-01 -0.488203 -0.848622 -0.668648 -0.475333
2013-01-02 -0.726290 -0.115516  1.716154 -0.503761
2013-01-03  1.786169 -1.615903  0.846360  1.299178

In [84]:
df['20130102':'20130104']

                   A         B         C         D
2013-01-02 -0.726290 -0.115516  1.716154 -0.503761
2013-01-03  1.786169 -1.615903  0.846360  1.299178
2013-01-04 -0.677843 -0.398273 -0.535052  0.759092

In [85]:
#Selecting on a multi-axis by label
df.loc[:,['A','B']]

                   A         B
2013-01-01 -0.488203 -0.848622
2013-01-02 -0.726290 -0.115516
2013-01-03  1.786169 -1.615903
2013-01-04 -0.677843 -0.398273
2013-01-05  0.121276 -0.345433
2013-01-06 -1.268046  0.155471

In [86]:
#Showing label slicing, both endpoints are included
df.loc['20130102':'20130104',['A','B']]

                   A         B
2013-01-02 -0.726290 -0.115516
2013-01-03  1.786169 -1.615903
2013-01-04 -0.677843 -0.398273

In [87]:
# Reduction in the dimensions of the returned object
df.loc['20130102',['A','B']]

A   -0.726290
B   -0.115516
Name: 2013-01-02 00:00:00, dtype: float64

In [88]:
 # For getting a scalar value
df.loc[dates[0],'A']

np.float64(-0.4882028101874192)

In [89]:
 # For getting fast access to a scalar
df.at[dates[0],'A']

np.float64(-0.4882028101874192)

In [90]:
# Select via the position of the passed integers
df.iloc[3]

A   -0.677843
B   -0.398273
C   -0.535052
D    0.759092
Name: 2013-01-04 00:00:00, dtype: float64

In [91]:
 # By integer slices, acting similar to numpy/python
df.iloc[3:5,0:2]

                   A         B
2013-01-04 -0.677843 -0.398273
2013-01-05  0.121276 -0.345433

In [92]:
# By lists of integer position locations, similar to the numpy/python style
df.iloc[[1,2,4],[0,2]]

                   A         C
2013-01-02 -0.726290  1.716154
2013-01-03  1.786169  0.846360
2013-01-05  0.121276 -0.458100

In [93]:
# For slicing rows explicitly
df.iloc[:,1:3]

                   B         C
2013-01-01 -0.848622 -0.668648
2013-01-02 -0.115516  1.716154
2013-01-03 -1.615903  0.846360
2013-01-04 -0.398273 -0.535052
2013-01-05 -0.345433 -0.458100
2013-01-06  0.155471  0.094142

In [94]:
# For getting a value explicitly
df.iloc[1,1]

np.float64(-0.11551579203929543)

In [95]:
# Using a single column’s values to select data.
df[df.A > 0]

                   A         B        C         D
2013-01-03  1.786169 -1.615903  0.84636  1.299178
2013-01-05  0.121276 -0.345433 -0.45810  0.734903

In [96]:
# Selecting values from a DataFrame where a boolean condition is met.
df[df > 0]

                   A         B         C         D
2013-01-01       NaN       NaN       NaN       NaN
2013-01-02       NaN       NaN  1.716154       NaN
2013-01-03  1.786169       NaN  0.846360  1.299178
2013-01-04       NaN       NaN       NaN  0.759092
2013-01-05  0.121276       NaN       NaN  0.734903
2013-01-06       NaN  0.155471  0.094142       NaN

In [97]:
# Using the isin() method for filtering:
df2 = df.copy()
df2['E'] = ['one', 'one','two','three','four','three']
df2

                   A         B         C         D      E
2013-01-01 -0.488203 -0.848622 -0.668648 -0.475333    one
2013-01-02 -0.726290 -0.115516  1.716154 -0.503761    one
2013-01-03  1.786169 -1.615903  0.846360  1.299178    two
2013-01-04 -0.677843 -0.398273 -0.535052  0.759092  three
2013-01-05  0.121276 -0.345433 -0.458100  0.734903   four
2013-01-06 -1.268046  0.155471  0.094142 -1.465262  three

In [98]:
df2[df2['E'].isin(['two','four'])]

                   A         B        C         D     E
2013-01-03  1.786169 -1.615903  0.84636  1.299178   two
2013-01-05  0.121276 -0.345433 -0.45810  0.734903  four